def ced_kod(dct):
    r1 = int(dct["R1"], base=16)
    r2 = int(dct["R2"], base=16) << 8
    r3 = int(dct["R3"], base=16) << 9
    r4 = int(dct["R4"], base=16) << 11
    r5 = int(dct["R5"], base=16) << 17
    return str(r1 | r2 | r3 | r4 | r5)


print(ced_kod({'R1': '0x65', 'R2': '0x1', 'R3': '0x0', 'R4': '0xa', 'R5': '0xc6'})) #Входные данные: Словарь из битовых полей. Значения битовых полей имеют тип: шестнадцатиричная строка. Выходные данные: Десятичная строка.
